export const FreelanceData = [
  {
    title: 'Автоматическая публикация новостей',
    description: 'Telegram Bot',
    year: 2025,
    developed: [
      'Разработал телеграм-бот для автоматического парсинга новостей и автоматической публикации их в Telegram канале',
      'Реализовал парсинг новостей с нескольких источников по категориям',
      'Интегрировал систему генерации уникальных изображений к постам через собственный API для работы с Midjourney',
      'Интегрировал ChatGPT для создания уникального текста к постам',
      'Создал масштабируемую архитектуру для обработки больших объемов контента в реальном времени',
    ],
  },
  {
    title: 'Аналитический бот для Wildberries',
    description: 'Telegram Bot',
    year: 2024,
    developed: [
      'Разработал телеграм-бот для комплексного анализа отзывов о товарах Wildberries',
      'Внедрил ChatGPT для выявления проблемных товаров, накрутки отзывов и анализа потребительских предпочтений',
      'Создал удобный вывод отзывов в формате таблицы с несколькими форматами (CSV, XLSX) для удобства пользователя',
    ],
  },
]
