export const ProjectsData = [
  {
    title: 'VALORY',
    links: ['@valorysu', 'beta.valory.su'],
    description: 'Мультиинструмент для стримеров',
    year: '2023 г. - настоящее время',
    developed: [
      'Спроектировал микросервисную архитектуру на FastAPI с авторизацией через OAuth 2.0',
      'Настроил работу с PostgreSQL и оптимизировал производительность с помощью кеширования Redis',
      'Разработал SPA-приложение на Vue 3 (Composition API) с TypeScript для типобезопасности',
      'Создал адаптивный интерфейс с TailwindCSS и кастомными компонентами на базе Reka UI',
      'Реализовал систему навигации через Vue Router, управление состоянием с Pinia и локализацию с Vue i18n',
      'Настроил контейнеризацию с Docker для единообразной среды разработки',
      'Внедрил ESLint и Prettier для поддержания качества кода',
    ],
  },
]
